from telethon import events

import FINAL.client
client = FINAL.client.client
@events.register(events.NewMessage(outgoing=True, pattern=".م9"))
async def ahelp(event):
	client.parse_mode = "markdown"  
	await event.delete()
	messagelocation = event.to_id
	await event.client.send_message(messagelocation, ("""**

 ⌯—————  اوامر التســليـه —————⌯


وحش - خنزير  - قاتل - سلاح  -كلب - هلو همف - زوج- رشفة - مرحبا - صورة ثعبان -قطة -همم - وداعا - شيتوز  -دسلايك - هينفو- النظام الشمسي - جيو - شرطة - طائرة - صندوق - مطر- احبك - فلايفمي - منصة - فراشة - قنبلة - ايموجي - احم - احبك2 - ذهبت - حب - سحر - تفاعل - ثلج - هاك. - غبي. .حلكك - مقاتل - قطار - فضائي - حالتي- قرد - يد -ضحك - حزين - ساعة - مح - قلب - جم - الارض -قمر-حلويات-قمور-حالة القمر-قلب ملون-قطار-فضائي-ثعبان 


︎`.نسبة + اي كلمة` 
بالرد او باليوزر 
نسبة الحب 
نسبة الذكاء 
نسبة الهراء... الخ....

︎`.نسبتنا + اي كلمة ` 
بالرد او باليوزر
.نسبتنا بالحب 
.نسبتنا بالكذب 
.نسبتنا بالهراء...الخ...

︎`.بوسة` | `.هينة`
بالرد او باليوزر 

`.رفع + اي كلمة` 
بالرد او باليوزر 
.رفع كيك 
.رفع حيوان 
.رفع تاج ....الخ..

`.زواج` | `.مقارنة` 
بالرد او باليوزر 

.اقتلة | باليوزر
**"""))

	client.parse_mode = "markdown"  
